HTTP Request Method

 

서버에서 주어진 리소스에 수행하길 원하는 행동을 나타낸다.
메소드에 따라 서버에서 여러가지 작업을 수행하도록 제작되었지만,
GET과 POST이외에는 찾아보기 힘들다.

 
<img src="https://user-images.githubusercontent.com/42057185/165762981-e431407f-a2d8-4aea-ae5a-f3a09e6e6e06.png"/>


1. GET

리소스를 검색하고, 반환받기 위해 사용되는 메소드이다.
원하는 정보를 서버에 요청할 때 쓰인다.

(일반적으로) 리소스의 위치를 URL에서 쿼리로 표현하기 때문에 RequestBody가 없다.


2. HEAD

서버의 각종 정보를 확인하기 위해 사용되는 메소드이다.
GET과 동일하지만, response에 Body가 없고 response Code와 Head만 응답받는다.


3. POST

요청된 자원을 생성하기 위해 사용되는 메소드이다.
POST로 정보를 전송하면 URL에 파라미터가 나타나지 않으므로 각종 데이터를 전송하는데 쓰인다.


4. PUT

요청된 자원을 수정하기 위해 사용되는 메소드이다.


5. PATCH

요청된 자원을 수정하기 위해 사용되는 메소드라는 점에서 PUT과 같지만,
해당 자원 전체를 수정하는 PUT과는 다르게 PATCH는 해당 자원의 일부 부분을 수정한다.


6. DELETE

요청한 자원을 삭제하기 위해 사용되는 메소드이다.
클라이언트에서 서버의 자원을 삭제할 수 있도록 허가하는 것은 매우 위험하다.
그러므로 현실적으로는 사용될 일이 거의 없고, 대부분의 서버는 이 메소드를 비활성화 시킨다.


7. TRACE

루프백 메시지를 호출하기 위해 테스트용으로 사용되는 메소드이다.


8. OPTION

웹서버에서 지원하는 메소드를 알기위해 사용되는 메소드이다.


9. CONNECT

프락시 기능을 요청할 때 사용되는 메소드이다.

<br><br><br><br><br><br><br><br><br>

출처 : https://gnaseel.tistory.com/24
